# Diameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..Diameter Property
DuctFittingAndAccessoryConnectorData Class See Also
---
The connector diameter, Units:(ft).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Diameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Diameter As Double
	Get
```

Visual C++
---
```text
public:
property double Diameter {
	double get ();
}
```

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace